artillery-src/search-and-add-to-cart.yml
config:
  target: "localhost:80"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "LinearRegression"
    flow:
      - get:
          url: "/linear-regression"
      - think: 5